package lab_4;

/**
 * Задачи на полиморфизм
 * ☑ 1.	Определить два класса Кит и Корова whale extend cow.
 * ☑ 2.	Переопределить метод getName в классе Whale(Кит), чтобы программа выдавала: Я не корова, Я – кит.
 * ☑ 3.	Написать метод, который определяет, объект какого класса ему передали, и выводит на экран одну из надписей: Кошка, Собака, Птица, Лампа.
 * ☑ 4.	Создать два класса Cat(кот) и Dog(собака), класс Dog(собака) происходит от Cat(кот). Определить метод getChild в классах Cat(кот) и Dog(собака), чтобы кот порождал кота, а собака – собаку.
 *
 * Задачи на перегрузку методов
 * 1.	Написать два метода: print(int) и print(String).
 * 2.	Написать два метода: print(int) и print(Integer).Написать такой код в методе main, чтобы вызвались они оба.
 * 3.	Написать пять методов print с разными параметрами.
 * ☑ 4.	Написать public static методы: int min(int, int), long min(long, long), double min(double, double). Каждый метод должен возвращать минимальное из двух переданных в него чисел.
 * ☑ 5.	Написать public static методы: int max(int, int), long max (long, long), double max (double, double). Каждый метод должен возвращать максимальное из двух переданных в него чисел.
 */
public class Main {

}
